# encoding=utf8
import re

# ll = 'http://www.51guashi.cn/onews.asp?id=93950'
tt = 'onews.asp?id=254790'
# result = re.findall('id=(\d+)', ll)
result = re.findall('.*?id=(\d+)', tt)
print(result)

name = '身份证挂失、遗失声明公告、挂失声明公告信息平台提示：\n付豪遗失声明公告\n证件名称：居民身份证\n姓名：付豪\n性别：男\n民族：汉族\n证件号码：37082619970404****\n归属省份：山东省\n签发机关：微山县公安局\n有效期限：2013.10.14 -2023.1014\n丢失日期：2018-10-18\n\n备注：\n自遗失当日起，如有冒用概与本人无关，特此声明\n--特此声明公告\n\n该信息来源于网络，本网站仅提供一个挂失声明公告信息平台。\n（挂失网www.51guashi.cn，原中国挂失网，唯一获得公安机关备案证书的声明公告网，中国最大的声明公告挂失网，提供证件挂失声明信息发布、查询，失物招领、寻找等服务，包括身份证挂失、公司证件、车辆手续、营业执照挂失遗失声明公告、毕业证、户口本、票据、学生证、军官证、资格证、护照、驾照以及其他个人证件挂失、遗失声明公告信息发布、查询等'
name = name.split('\n')
# name = name.split('\n')[3].replace('姓名:', ' ')
print(name)
# for i in name:
# 	print(i)
